global_esb/src/main/resources/request.xsd

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Header >
        <callbackURL xmlns="http://esmt.sn/gesb/soam">http://example.com/callback</callbackURL>
    </Header>
    <Body>
        <esbRootActionRequest requestId="1235864" xmlns="http://esmt.sn/gesb/soam">
            <esbContent verb="ADD">
                <esbParameter name="subscriberName" newValue="Razacki" oldValue = "" />
                <esbParameter name="phoneNumber" newValue="+221785900131" oldValue = "" />
                <esbParameter name="subscriberType" newValue="PRE_PAID" oldValue = "" />
                <esbParameter name="imsi" newValue="10547544" oldValue = "" />
            </esbContent>
        </esbRootActionRequest>
    </Body>
</Envelope>